Тестовая_база_ERP_14/src/DataProcessors/ИсправлениеРазвернутыхОстатковПоВзаиморасчетам/ИсправлениеРазвернутыхОстатковПоВзаиморасчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИсправлениеРазвернутыхОстатковПоВзаиморасчетам</name>
  <tabularSections>
    <name>ДокументыВзаимозачетаЗадолженности</name>
    <attributes>
      <name>АналитикаУчетаПоПартнерам</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийВзаимозачетаЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолгОстаток</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентДебитор</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентКредитор</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоплатаОстаток</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Руководитель</name>
      <type>
        <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданныйДокумент</name>
      <type>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДебитора</name>
      <type>
        <types>EnumRef.ТипыУчастниковВзаимозачета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКредитора</name>
      <type>
        <types>EnumRef.ТипыУчастниковВзаимозачета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчетов</name>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/Documents/ВзаимозачетЗадолженности/ВзаимозачетЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВзаимозачетЗадолженности</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютеРегл</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНОСиНМА</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДебитор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКредитор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВзаимозачетаЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияКредитор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДебитора</name>
    <type>
      <types>EnumRef.ТипыУчастниковВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКредитора</name>
    <type>
      <types>EnumRef.ТипыУчастниковВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОтчетДавальцу</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовИнтеркампани</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДебиторскаяЗадолженность</name>
    <attributes>
      <name>ТипРасчетов</name>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КредиторскаяЗадолженность</name>
    <attributes>
      <name>ТипРасчетов</name>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/DataProcessors/ИсправлениеРазвернутыхОстатковПоВзаиморасчетам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Вызывается извне обработки.
//
Процедура СоздатьДокументыВзаимозачетЗадолженности(ПараметрыЗапуска, АдресХранилища) Экспорт

	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Обработка.ИсправлениеРазвернутыхОстатковПоВзаиморасчетам");
	
	УстановитьПривилегированныйРежим(Истина);
	СписокСозданныхДокументов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, "СписокСозданныхДокументов");
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Сообщения", Неопределено);
	РезультатВыполнения.Вставить("СписокСозданныхДокументов", ?(ЗначениеЗаполнено(СписокСозданныхДокументов), СписокСозданныхДокументов, Новый Соответствие));
	РезультатВыполнения.Вставить("АналитикаКРасчету", Новый СписокЗначений);
	
	Для Каждого СтрокаТЧ Из ПараметрыЗапуска Цикл
		Если СтрокаТЧ.Пометка И НЕ ЗначениеЗаполнено(СтрокаТЧ.СозданныйДокумент) Тогда
			СоздатьДокументВзаимозачетЗадолженности(СтрокаТЧ, РезультатВыполнения);
		КонецЕсли
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, РезультатВыполнения.СписокСозданныхДокументов, "СписокСозданныхДокументов");
	УстановитьПривилегированныйРежим(Ложь);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

Процедура СоздатьДокументВзаимозачетЗадолженности(ПараметрыЗаполнения, РезультатВыполнения)
	
	Если ТипЗнч(ПараметрыЗаполнения.КонтрагентДебитор) <> Тип("СправочникСсылка.Организации")
		И ТипЗнч(ПараметрыЗаполнения.КонтрагентКредитор) <> Тип("СправочникСсылка.Организации") Тогда
		
		ДокументОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыЗаполнения);
		
		РасшифровкаДебет = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(РасшифровкаДебет, ПараметрыЗаполнения);
		
		РасшифровкаКредит = ДокументОбъект.КредиторскаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(РасшифровкаКредит, ПараметрыЗаполнения);
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ПараметрыЗаполнения.СозданныйДокумент = ДокументОбъект.Ссылка;
			РезультатВыполнения.СписокСозданныхДокументов.Вставить(ПараметрыЗаполнения.ИдентификаторДокумента, ДокументОбъект.Ссылка);
			РезультатВыполнения.АналитикаКРасчету.Добавить(ПараметрыЗаполнения.АналитикаУчетаПоПартнерам);
		Исключение
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(РезультатВыполнения.Сообщения, "", ОписаниеОшибки(), "");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается извне обработки.
//
Процедура УдалитьСозданныеДокументы(ПараметрыЗапуска, АдресХранилища) Экспорт
	
	РезультатУдаления 	= Новый Соответствие();
	Владелец 			= ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Обработка.ИсправлениеРазвернутыхОстатковПоВзаиморасчетам");
	
	УстановитьПривилегированныйРежим(Истина);
	СозданныеДокументы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, "СписокСозданныхДокументов");
	УстановитьПривилегированныйРежим(Ложь);
	
	
	Для Каждого СтрокаСоответствия Из ПараметрыЗапуска.ДокументыКУдаленю Цикл
		Если СтрокаСоответствия.Значение = СозданныеДокументы[СтрокаСоответствия.Ключ] Тогда
			РезультатУдаления.Вставить(СозданныеДокументы[СтрокаСоответствия.Ключ], СтрокаСоответствия.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	МассивПомеченныхНаУдаление = Новый Массив;
	СписокОшибок = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СсылкаНаУдаление Из РезультатУдаления Цикл
		ДокументОбъект = СсылкаНаУдаление.Ключ.ПолучитьОбъект();
		Если ДокументОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокументОбъект.Заблокировать();
		Исключение
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
				"Объект.ДокументыВзаимозачетаЗадолженности",
				ОписаниеОшибки(), 
				Неопределено);
				Продолжить;
		КонецПопытки;
		
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		МассивПомеченныхНаУдаление.Добавить(СсылкаНаУдаление.Ключ);
	КонецЦикла;
	
	ТабСсылок = НайтиПоСсылкам(МассивПомеченныхНаУдаление);
	
	СтрСообщения = НСтр("ru = 'Имеются ссылки на объект %1 в %2. Документ не будет удален.';
						|en = 'There are references to the %1 object in %2. Document will not be deleted.'");	
	
	Для Каждого Ссылка Из ТабСсылок Цикл
		Если ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.ЗаданияКРаспределениюРасчетовСКлиентами")
			ИЛИ ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.ЗаданияКРаспределениюРасчетовСПоставщиками")
			ИЛИ ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.ДанныеПервичныхДокументов")
			ИЛИ ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.РеестрДокументов")
			ИЛИ ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.ДокументыСОшибкамиПроверкиКонтрагентов")
			//++ НЕ УТКА
			ИЛИ ТипЗнч(Ссылка[1]) = Тип("РегистрСведенийКлючЗаписи.ЗаданияКОтражениюВБюджетировании")
			//-- НЕ УТКА
			Тогда
			Продолжить;
		КонецЕсли;
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрСообщения, СокрЛП(Ссылка[0]), СокрЛП(Ссылка[1]));
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
			"Объект.ДокументыВзаимозачетаЗадолженности[%1].СозданныйДокумент",
			ТекстОшибки, 
			Неопределено);
			
		Индекс = МассивПомеченныхНаУдаление.Найти(Ссылка[0]);
		Если Индекс <> Неопределено Тогда
			МассивПомеченныхНаУдаление.Удалить(Индекс);
			РезультатУдаления.Удалить(Ссылка[0]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Документ Из РезультатУдаления Цикл
		Попытка
			ДокументОбъект = Документ.Ключ.ПолучитьОбъект();
			ДокументОбъект.Удалить();
		Исключение
			РезультатУдаления.Удалить(Документ.Ключ);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
				"Объект.ДокументыВзаимозачетаЗадолженности",
				ОписаниеОшибки(), 
				Неопределено
				,
				);
		КонецПопытки;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Структура("Ошибки, УдаленныеДокументы", СписокОшибок, РезультатУдаления);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
